// Дан двухмерный массив с числами:

// let arr = [[1, 2, 3], [4, 5], [6]];
// С помощью вложенных циклов найдите сумму элементов этого массива.

// let arr = [[1, 2, 3], [4, 5], [6]];
// let sum = 0;

// for (let subArr of arr) {
//   for (let elem of subArr) {
//     sum += elem;
//   }
// }

// console.log(sum);

// Дан трехмерный массив с числами:

// let arr = [[[1, 2], [3, 4]], [[5, 6], [7, 8]]];
// С помощью вложенных циклов найдите сумму элементов этого массива.

// let arr = [
//   [
//     [1, 2],
//     [3, 4],
//   ],
//   [
//     [5, 6],
//     [7, 8],
//   ],
// ];
// let sum = 0;

// for (subArr of arr) {
//   for (subSubArr of subArr) {
//     for (elem of subSubArr) {
//       sum += elem;
//     }
//   }
// }

// console.log(sum);

// С помощью вложенных циклов найдите сумму элементов этого массива.

// let arr = [[1, 2, 3], [4, 5], [6]];
// let sum = 0;

// for (i = 0; i < arr.length; i++) {
//   for (j = 0; j < arr[i].length; j++) {
//     sum += arr[i][j];
//   }
// }

// console.log(sum);

// Дан трехмерный массив с числами:

// let arr = [[[1, 2], [3, 4]], [[5, 6], [7, 8]]];
// С помощью вложенных циклов найдите сумму элементов этого массива.

// let arr = [
//   [
//     [1, 2],
//     [3, 4],
//   ],
//   [
//     [5, 6],
//     [7, 8],
//   ],
// ];
// let sum = 0;

// for (i = 0; i < arr.length; i++) {
//   for (j = 0; j < arr[i].length; j++) {
//     for (k = 0; k < arr[i][j].length; k++) {
//       sum += arr[i][j][k];
//     }
//   }
// }

// console.log(sum);
