// Сформируйте с помощью двух вложенных циклов следующий массив:

// [
//   [1, 2],
//   [3, 4],
//   [5, 6],
//   [7, 8],
// ];

// let arr = [];

// for (let i = 0, k = 1; i < 4; i++) {
//   arr[i] = [];
//   for (let j = 0; j < 2; j++) {
//     arr[i].push(k++);
//   }
// }

// console.log(arr);

// Сформируйте с помощью двух вложенных циклов следующий массив:

// [[2, 4, 6], [8, 10, 12], [14, 16, 18], [20,
// 	22, 24]]

// let arr = [];

// for (let i = 0, k = 2; i < 4; i++) {
//   arr[i] = [];
//   for (let j = 0; j < 3; j++) {
//     arr[i].push(k);
//     k += 2;
//   }
// }

// console.log(arr);

// Сформируйте с помощью трех вложенных циклов следующий трехмерный массив:

// [[[1, 2], [3, 4]], [[5, 6], [7, 8]]]

// let arr = [];
// for (let i = 0, c = 1; i < 2; i++) {
//   arr[i] = [];
//   for (let j = 0; j < 2; j++) {
//     arr[i][j] = [];
//     for (let k = 0; k < 2; k++) {
//       arr[i][j].push(c++);
//     }
//   }
// }

// console.log(arr);

// Автор следующего кода хотел сделать вот такой массив:

// [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
// Для этого был написан следующий код:

// let arr = [];

// for (let i = 0, k = 1; i < 3; i++) {
//   arr[i] = [];

//   for (let j = 0; j < 3; j++) {
//     arr[i].push(k);
//     k++;
//   }
// }

// console.log(arr);
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.

// Автор следующего кода хотел сделать вот такой массив:

//  [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
// Для этого был написан следующий код:

// let arr = [];
// let k = 1;

// for (let i = 0; i < 3; i++) {
//   arr[i] = [];

//   for (let j = 0; j < 3; j++) {
//     arr[i].push(k++);
//   }
// }

// console.log(arr);
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.

// Автор следующего кода хотел сделать вот такой массив:

// [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
// Для этого был написан следующий код:

// let arr = [];
// let k = 1;

// for (let i = 0; i < 3; i++) {
//   arr[i] = [];

//   for (let j = 0; j < 3; j++) {
//     arr[i].push(k);
//     k++;
//   }
// }

// console.log(arr);
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.

// Автор следующего кода хотел сделать вот такой массив:

// [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
// Для этого был написан следующий код:

// let arr = [];
// let k = 1;

// for (let i = 0; i < 3; i++) {
//   arr[i] = [];

//   for (let j = 0; j < 3; j++) {
//     arr[i].push(k);
//     k++;
//   }
// }

// console.log(arr);
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.

// Автор следующего кода хотел сделать вот такой массив:

// [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
// Для этого был написан следующий код:

// let arr = [];

// for (let i = 0, k = 1; i < 3; i++) {
//   arr[i] = [];

//   for (let j = 0; j < 3; j++) {
//     arr[i].push(k++);
//   }
// }

// console.log(arr);
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.

// Автор следующего кода хотел сделать вот такой массив:

// [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
// Для этого был написан следующий код:

// let arr = [];

// for (let i = 0, k = 1; i < 3; i++) {
//   arr[i] = [];

//   for (let j = 0; j < 3; j++) {
//     arr[i].push(k);
//     k++;
//   }
// }

// console.log(arr);
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.

// Автор следующего кода хотел сделать вот такой массив:

// [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
// Для этого был написан следующий код:

// let arr = [];

// for (let i = 0, k = 1; i < 3; i++) {
//   arr[i] = [];

//   for (let j = 0; j < 3; j++) {
//     arr[i].push(k++);
//   }
// }

// console.log(arr);
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.

// Автор следующего кода хотел сделать вот такой массив:

// [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
// Для этого был написан следующий код:

// let arr = [];

// for (let i = 0, k = 1; i < 3; i++) {
//   arr[i] = [];

//   for (let j = 0; j < 3; j++) {
//     arr[i].push(k++);
//   }
// }

// console.log(arr);
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.

// Автор следующего кода хотел сделать вот такой массив:

// [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
// Для этого был написан следующий код:

// let arr = [];

// for (let i = 0, k = 1; i < 3; i++) {
//   arr[i] = [];

//   for (let j = 0; j < 3; j++) {
//     arr[i].push(k++);
//   }
// }

// console.log(arr);
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.
