// let arr = [
//   ['a', 'b', 'c'],
//   ['d', 'e', 'f'],
//   ['g', 'h', 'i'],
//   ['j', 'k', 'l'],
// ];
// //Выведите с его помощью элементы с текстом 'l', 'e', 'g' и 'a'.

// console.log(arr[3][2] + arr[1][1] + arr[2][0] + arr[0][0]);

// let arr = [[1, 2], [3, 4], [5, 6]];
// Обращаясь к каждому элементу массива найдите сумму всех его элементов.

// let arr = [
//   [1, 2],
//   [3, 4],
//   [5, 6],
// ];
// let sum = arr[0][0] + arr[0][1] + arr[1][0] + arr[1][1] + arr[2][0] + arr[2][1];

// console.log(sum);

// Дан следующий массив:

// let arr = [
// 	[
// 		[1, 2],
// 		[3, 4],
// 	],
// 	[
// 		[5, 6],
// 		[7, 8],
// 	],
// ];
// Обращаясь к каждому элементу массива найдите сумму всех его элементов.

// let arr = [
//   [
//     [1, 2],
//     [3, 4],
//   ],
//   [
//     [5, 6],
//     [7, 8],
//   ],
// ];

// console.log(
//   arr[0][0][0] +
//     arr[0][0][1] +
//     arr[0][1][0] +
//     arr[0][1][1] +
//     arr[1][0][0] +
//     arr[1][0][1] +
//     arr[1][1][0] +
//     arr[1][1][1]
// );

//Вручную, без цикла, найдите сумму элементов этого массива.

let arr = [
  [1, 2, 3, [4, 5, [6, 7]]],
  [8, [9, 10]],
];

console.log(
  arr[0][0] +
    arr[0][1] +
    arr[0][2] +
    arr[0][3][0] +
    arr[0][3][1] +
    arr[0][3][2][0] +
    arr[0][3][2][1] +
    arr[1][0] +
    arr[1][1][0] +
    arr[1][1][1]
);
